/*
 *  @File   EnemyCollision.cpp
 *  @Brief  敵同士の当たり判定。
 *  @Date   2024-02-05
 *  @Author NakamuraRyo
 */

#include "pch.h"
#include "Game/Common/Blocks/Spike/Spike.h"
#include "EnemyCollision.h"

//==============================================================================
// コンストラクタ
//==============================================================================
EnemyCollision::EnemyCollision()
{
}

//==============================================================================
// デストラクタ
//==============================================================================
EnemyCollision::~EnemyCollision()
{
}
